Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Bundling and Deploying Applications in Containers
zh_cn: 在容器中打包并部署应用

source: But first, let’s define the term data stream: a data stream is a potentially unbounded sequence of events.
zh_cn: 在此之前我们先给出数据流的定义：数据流是一个可能无限的事件序列。

source: But first, we define the term data stream:
zh_cn: 在此之前需要先定义数据流：

source: But in practice you might want to partition a stream into multiple logical streams and define parallel windows.
zh_cn: 但在实际应用中，你可能会想将数据流划分为多条逻辑流并定义一些并行窗口（parallel window）。

source: But it differs from regular list state in how it is restored in the case of a failure or when an application is started from a savepoint.
zh_cn: 但在进行故障恢复或从某个保存点启动应用时，状态的恢复方式和普通列表状态有所不同。

source: But there are much more time-critical applications whose semantics we need to guarantee.
zh_cn: 但其实还有更多时间敏感应用，需要我们对其处理语义进行保障。

source: But what if your job is a long- running streaming job?
zh_cn: 但如果是需要长时间运行的流式作业又该如何？

source: But your Flink journey has just started, and this chapter points to the possible paths you can take from here.
zh_cn: 但你和Flink的结伴之旅才刚刚开始，本章将为你指引后续的前进方向。

source: By calling setFlushOnCheck point(false) on the sink object, you can disable this waiting.
zh_cn: 你可以在数据汇连接器对象上调用setFlushOnCheckpoint(false)来禁用该等待。

source: By changing the data type of a state, such as changing a ValueState[Int] to a
zh_cn: 通过更改状态的数据类型，例如将ValueState[Int]改为ValueState[Double]

source: By changing the type of a state primitive, as for example by changing a Value State[List[String]] to a ListState[String]
zh_cn: 通过更改状态原语类型，例如将ValueState[List[String]]改为ListState[String]

source: By computing results only based on the actual data, these systems are also able to process historical data in the same way as “live” data, i.e., data which is inges‐ ted as soon as it is produced.
zh_cn: 由于只需依靠实际数据本身计算结果，此类系统可以将历史数据当做"实时"数据进行处理，如同它们一产生就传入系统一样。

source: By configuring only a single slot per TaskManager, you can isolate applications across TaskManagers, i.e., run only tasks of a single application on a TaskManager.
zh_cn: 通过将每个TaskManager配置成只有一个处理槽，可以将应用在TaskManager级别进行隔离，即每个TaskManager只运行单个应用的任务。

source: By configuring only a single slot per TaskManager, you can isolate applications across TaskManagers.
zh_cn: 如果将每个TaskManager配置成只有一个处理槽，则可以限制应用在TaskManager级别进行隔离，即每个TaskManager只运行单个应用的任务。

source: By default, 10% of the JVM heap size is used.
zh_cn: 默认配置是使用JVM堆内存的10%。

source: By default, Flink allows only one checkpoint to be in progress at a time to avoid checkpointing takeing away too many resources needed for regular processing.
zh_cn: 默认情况下，Flink一次只允许生成一个检查点，以免它占用常规处理太多资源。

source: By default, Flink assigns unique operator identifiers.
zh_cn: 默认情况下，Flink会给每个算子分配一个唯一标识。

source: By default, Flink creates checkpoints to guarantee exactly-once state consistency.
zh_cn: 默认情况下，Flink会通过创建检查点保证内部状态的精确一次语义。

source: By default, Flink looks up user-code classes first in the child (user-code) classloader and then in parent (system) classloader to prevent version clashes in case a job uses
zh_cn: 为了防止作业和Flink使用相同依赖而引起冲突，Flink在默认情况下会先从用户类加载器中查找用户类，如果没有发现再去父（系统）类加载器中查找。

source: By default, Flink starts JVM processes using the Java executable linked by the PATH environment variable.
zh_cn: Flink默认会使用PATH环境变量中的Java执行文件来启动JVM进程。

source: By default, Flink uses the SLF4J logging abstraction together with the log4j logging framework.
zh_cn: 默认情况下，Flink使用SLF4J日志抽象和log4j日志框架。

source: By default, Flink will not start applications that do not restore all states that are con‐ tained in a savepoint to avoid losing the state in the savepoint.
zh_cn: 为了避免保存点中的状态丢失，Flink在默认情况下不会启动那些无法将保存点中的状态全部恢复的应用。

source: By default, RocksDB is optimized for SSD storage and does not provide great performance if state is stored on spinning
zh_cn: 默认情况下，RocksDB针对SSD存储做出了很多优化，因此在使用传统机械硬盘存储状态时性能可能并不出色。

source: By default, SSL authentication and encryption is not enabled.
zh_cn: SSL验证和加密在默认情况下都处于关闭状态。

source: By default, StreamingFileSink uses a DefaultRollingPolicy, which is configured to roll part files when they exceed 128 MB or are older than 60 seconds.
zh_cn: 默认情况下，StreamingFileSink将使用DefaultRollingPolicy，它会在现有文件大小超过128MB或打开时间超过60秒时创建一个新的分块文件。

source: By default, a failing checkpoint causes an exception that results in an application restart.
zh_cn: 默认情况下，检查点生成失败会抛出异常导致应用重启。

source: By default, both are exposed on port 8081.
zh_cn: 默认情况下，二者都会使用8081端口。

source: By default, checkpoints are canceled after 10 minutes.
zh_cn: 默认情况下，检查点生成操作会在10分钟后被取消。

source: By default, data is written to the default tem‐ porary directory as determined by the Java system property java.io.tmpdir, or /tmp on Linux and MacOS.
zh_cn: 默认情况下，数据会写入默认临时目录（由Java系统变量java.io.tmpdir决定，或Linux及MacOS下的/tmp目录）。

source: By default, each operator is in the "default" slot-sharing group.
zh_cn: 默认情况下，所有算子都属于"default"处理槽共享组。

source: By default, it automatically restarts failed master and TaskManager containers.
zh_cn: 默认情况下它会自动重启发生故障的主进程容器和TaskManager容器。

source: By default, it is started with 1 GB JVM heap memory.
zh_cn: 它默认的JVM堆内存数量只有1GB。

source: By default, local recovery is deactivated.
zh_cn: 默认情况下，本地恢复处于禁用状态。

source: By default, only the core API dependencies (DataStream and DataSet APIs) are loaded by a Flink cluster.
zh_cn: 默认情况下，Flink集群只会加载核心API依赖（DataStream和DataSet API），

source: By default, the client does not return after submitting the application but waits for it to terminate.
zh_cn: 默认情况下，客户端在提交应用后不会立即返回，而是会等待其终止。

source: By default, the client submits an application to the Flink master specified by the ./conf/flink-conf.yaml file (see the configuration for different setups in “System Configuration”).
zh_cn: 默认情况下，客户端会将应用提交到./conf/flink-conf.yaml文件中所指定的Flink主进程（有关其他配置请参阅"系统配置"一节）。

source: By default, the parallelism of all operators of an application is set as the parallelism of the application’s execution environment.
zh_cn: 默认情况下，应用内所有算子的并行度都会被设置为应用执行环境的并行度。

source: By default, the script prints the connec‐ tion information of the session cluster and does not return.
zh_cn: 默认情况下，该脚本会打印出会话集群的连接信息，但并不会结束返回。

source: By default, tumbling windows are aligned to the epoch time, 1970-01-01-00:00:00.000.
zh_cn: 默认情况下，滚动窗口会和纪元时间1970-01-01-00:00:00.000对齐。

source: By injecting the barrier into its output stream, the source function defines the stream position on which the checkpoint is taken.
zh_cn: 通过向输出流中注入分隔符，数据源函数定义了需要在流中哪些位置生成检查点。

source: By lever‐ aging thread-parallelism inside of a TaskManager and the option to deploy several TaskManager processes per host, Flink offers a lot of flexibility to trade off perfor‐ mance and resource isolation when deploying applications.
zh_cn: 通过在TaskManager内部采用线程并行以及支持在每个主机上部署多个TaskManager进程，Flink为部署应用时性能和资源隔离的取舍提供了极大的自由度，

source: By leveraging thread parallelism inside a TaskManager and deploying several TaskMan‐ ager processes per host, Flink offers a lot of flexibility to trade off performance and resource isolation when deploying applications.
zh_cn: 通过在TaskManager内部采用线程并行以及在每个主机上部署多个TaskManager进程，Flink为部署应用时性能和资源隔离的取舍提供了极大的自由度。

source: By only computing results based on actual data, these systems are also able to process historical data in the same way as “live” data.
zh_cn: 由于只需依靠实际数据计算结果，此类系统可以将历史数据当做"实时"数据进行处理。

source: By only writing data once a checkpoint is completed, the transac‐ tional approach does not suffer from the replay inconsistency of the idempotent writes.
zh_cn: 通过只在检查点完成后写入数据，这种事务性的方法虽然不会像幂等性写那样出现重放过程中的不一致现象，

source: By processing several streams in parallel, you can lower the latency while processing more events at the same time.
zh_cn: 通过并行处理多条数据流，你可以在处理更多事件的同时降低延迟。

source: By processing several streams in parallel, you lower the latency while processing more events at the same time.
zh_cn: 通过并行处理多条数据流，可以在处理更多事件的同时降低延迟。

source: By providing a custom FlinkKafkaPartitioner, you can control how records are routed to topic partitions.
zh_cn: 你可以通过提供一个自定义的FlinkKafkaPartitioner来控制数据到主题分区的路由方式。

source: By providing a list of state objects, functions with operator state can implement this logic using the snapshotState() and restoreState() methods.
zh_cn: 而通过提供状态对象列表，状态化函数就能使用snapshotState()和restoreState()方法来实现自动化逻辑。

source: By relying on event time, we can guarantee result correctness even in cases of out-of- order data.
zh_cn: 依靠事件时间，我们可以保证在数据乱序的情况下结果依然正确，

source: By relying on event time, we can guarantee result correctness even in such cases.
zh_cn: 依靠事件时间，我们可以保证上述情况中结果正确，

source: By resetting the state of a (possibly modified) application and replaying the input, it is possible to fix a bug of the applica‐ tion and repair its effects, deploy new versions of an application without losing its state, or run what-if or A/B tests.
zh_cn: 通过重置（变更后）应用的状态并重放输入，可以修复应用bug或消除影响，在不丢失状态的情况下部署新版本，进行假设验证或A/B测试。

source: CHAPTER 1
zh_cn: 第1章

source: CHAPTER 10
zh_cn: 第10章

source: CHAPTER 11
zh_cn: 第11章

source: CHAPTER 2
zh_cn: 第2章

source: CHAPTER 3
zh_cn: 第3章

source: CHAPTER 4
zh_cn: 第4章

source: CHAPTER 5
zh_cn: 第5章

source: CHAPTER 6
zh_cn: 第6章

source: CHAPTER 7
zh_cn: 第7章

source: CHAPTER 8
zh_cn: 第8章

source: CHAPTER 9
zh_cn: 第9章

source: CONTEXT defines
zh_cn: CONTEXT用于指定一个可选的自定义上下文对象的类型。

source: Called after windowing function.
zh_cn: 在窗口函数之后调用。

source: Called before windowing function.
zh_cn: 在窗口函数之前调用。

source: Canceling an Application Might Fail
zh_cn: 应用可能会取消失败

source: Canceling an Application with a Savepoint Might Fail
zh_cn: 生成保存点并取消应用可能会失败

source: Canceling an application
zh_cn: 取消应用

source: Cancels the application
zh_cn: 取消应用

source: Case class fields are accessed by name.
zh_cn: 样例类的字段可以按名称访问。

source: Cassandra models datasets as tables of rows that consist of multiple typed col‐ umns.
zh_cn: Cassandra将数据集建模成由多个类型的列所组成的行表。

source: Cassandra sinks are created and configured using a builder that is obtained by calling the CassandraSink.addSink() method with the DataStream object that should be emitted.
zh_cn: Cassandra数据汇的创建和配置都是通过构建器来完成的，为此，我们要以写出目标DataStream对象为参数去调用CassandraSink.addSink()方法，得到一个构建器。

source: Cassandra’s data model is based on primary keys, and all writes to Cassandra happen with upsert semantics.
zh_cn: Cassandra的数据模型是基于主键的，因此对于它的写操作都遵循Upsert语义。

source: Categories include CPU utilization, memory used, number of active threads, garbage collection statistics, network metrics such as the number of queued input/output buf‐ fers, cluster-wide metrics such as the number or running jobs and available resources, job metrics including runtime, the number of retries and checkpointing information, I/O statistics including the number of record exchanges locally and remotely, water‐ mark information, connector-specific metrics, etc.
zh_cn: 指标类别包括CPU利用率，内存使用情况，活动的线程数，垃圾回收统计，网络指标（例如输入或输出缓冲区的堆积情况），集群范围的指标（例如正在运行的作业数量或信息及可用资源），作业指标（包括运行时信息、重试次数和检查点信息），I/O统计数据（包括本地或远程交换的记录数），水位线信息以及连接器特定指标等。

source: Chained task execution with fused function in a single thread and data pass‐ ing via method calls.
zh_cn: 在结合多个函数的链接任务执行过程中，数据通过方法调用传输。

source: Chained task execution with fused functions in a single thread and data passing via method calls
zh_cn: 单线程执行的链接任务"融合"了多个函数，并通过方法调用进行数据传输

source: Changes in the configuration file are not effective until Flink is restarted.
zh_cn: 所有对于该配置文件的修改都需要重启Flink才能生效。

source: Changing the Input Data Type of Built-in Stateful Operators
zh_cn: 改变内置状态化算子的输入数据类型

source: Changing the data type of a state is possible in a few specific cases.
zh_cn: 在某些特定情况下，你可以改变状态的数据类型。

source: Chapter 1 gives an overview of stateful stream processing, data processing appli‐ cation architectures, application designs, and the benefits of stream processing over traditional approaches.
zh_cn: 第1章是概述，我们在其中概括了状态化流处理、数据处理应用的架构和设计以及流处理和传统方法相比的优势所在，

source: Chapter 1 is an overview of stateful stream processing, data processing application architectures, application designs, and benefits over traditional approaches.
zh_cn: 第1章是概览，我们在其中回顾了状态化流处理、数据处理应用的架构和设计以及和传统方法相比的优势。

source: Chapter 10 covers operation, monitoring, and maintenance of streaming applications that run 24/7.
zh_cn: 第10章涵盖了针对7*24小时运行的流处理任务的操作、监控和运维等内容。

source: Chapter 10 covers operation, monitoring, and maintenance of streaming applica‐ tions that run 24/7.
zh_cn: 第10章涵盖了针对7×24小时运行的流处理应用的操作、监控和运维等内容。

source: Chapter 10 describes how to trigger and dispose savepoints.
zh_cn: 第10章介绍了如何生成和删除保存点。

source: Chapter 10 discusses job submission and the REST interface.
zh_cn: 第10章将讨论作业提交和REST接口。

source: Chapter 10 explains how to take savepoints of running applications and how to start a new application from an existing savepoint.
zh_cn: 第10章介绍了如何为运行中的应用创建保存点以及如何从现有的保存点启动一个新的应用。

source: Chapter 10 gives guidance on how to operate stateful applications—taking and restoring from application savepoints, rescaling applications, and performing application upgrades.
zh_cn: 第10章指导你如何操纵状态化应用，具体包括创建和恢复应用保存点，对应用进行扩缩容以及应用更新等内容。

source: Chapter 10 will discuss how the DataStream API allows to control the assignment and grouping of tasks.
zh_cn: 在第10章会讨论如何通过DataStream API控制任务分配及分组。

source: Chapter 1: Introduction to Stateful Stream Processing
zh_cn: 第1章：状态化流处理介绍

source: Chapter 2 discussed important concepts of distributed stream processing, such as parallelization, time, and state.
zh_cn: 我们在第2章主要讨论了分布式流处理中的一些重要概念，例如：并行、时间和状态等。

source: Chapter 2 discusses fundamental concepts and challenges of stream processing and its content is rather independent of Flink.
zh_cn: 第2章主要讨论流处理的基本概念和挑战，这些内容都是独立于Flink而存在。

source: Chapter 2 discusses the fundamental concepts and challenges of stream process‐ ing, independent of Flink.
zh_cn: 第2章主要讨论流处理的基本概念和挑战，这些内容均是独立于Flink而存在的。

source: Chapter 2: Stream Processing Fundamentals
zh_cn: 第二章：流处理基础

source: Chapter 3 describes Flink’s system architecture and internals.
zh_cn: 第3章是描述Flink的系统架构和内部实现，

source: Chapter 3: The Architecture of Apache Flink
zh_cn: 第3章：Apache Flink架构

source: Chapter 4 explains how to set up an environment to develop and debug Flink applications.
zh_cn: 第4章讲解如何配置用于开发和调试Flink应用的环境。

source: Chapter 5 introduces you to the basics of the Flink’s DataStream API.
zh_cn: 第5章介绍Flink DataStream API的基础知识，

source: Chapter 5 will introduce you to the basics of the DataStream API, and Chapters 6, 7, and 8 will introduce everything you need to know about time-based operators, state‐ ful functions, and source and sink connectors.
zh_cn: 我们会在第5章介绍DataStream API的基础知识，在第6、7、8章分别介绍有关基于时间的算子、状态化函数以及数据源和数据汇连接器的全部内容。

source: Chapter 6 discusses the time-based operators of the DataStream API.
zh_cn: 第6章讨论DataStream API中基于时间的算子，

source: Chapter 7 explains how to implement stateful functions and discusses everything around this topic, such as the performance, robustness, and evolution of stateful functions.
zh_cn: 第7章介绍如何实现状态化函数以及一些与之相关的问题，例如性能、健壮性、状态函数演变等。

source: Chapter 8 presents Flink’s most commonly used source and sink connectors.
zh_cn: 第8章介绍Flink中最常用的数据源（Data Source）和数据汇（Data Sink）连接器，

source: Chapter 9 discusses how to set up and configure Flink clusters in various environments.
zh_cn: 第9章讨论如何针对不同环境搭建和配置Flink集群。

source: Chapter 9 discusses how to setup and configure Flink clusters in various environ‐ ments.
zh_cn: 第9章讨论如何针对不同环境搭建和配置Flink集群。

source: Chapter 9 explains how to set up and configure Flink to reliably process stateful applications.
zh_cn: 第9章介绍了如何设置Flink使其能够可靠地处理状态化应用。

source: Chapters 2 and 3 discussed the foundations of stateful stream processing and related details of Flink’s architecture, respectively.
zh_cn: 第2、3两章分别讨论了状态化流处理的基础以及Flink架构的相关细节。

source: Chapters 4 to 8 is where you get our hands dirty and start developing Flink applica‐ tions.
zh_cn: 第4到8章会带你着手开发Flink应用。

source: Check the Configuration of Your Kafka Cluster
zh_cn: 检查Kafka集群的配置

source: CheckpointCommitter is used to store information about completed check‐
zh_cn: CheckpointCommitter用来将已完成的检查点信息写入外部数据存储中。

source: Checkpointing and State Backends
zh_cn: 检查点和状态后端

source: Checkpointing can be an expensive operation since the amount of data that needs to be copied to a persistent storage can be quite large.
zh_cn: 由于在生成检查点时可能需要将大量数据写入持久化存储中，所以其代价可能非常昂贵

source: Checkpointing metrics
zh_cn: 检查点指标

source: Checkpoints are automatically created, loaded in case of a failure, and automatically removed by Flink (depending on the configuration of the application).
zh_cn: 检查点会自动创建，在发生故障时自动加载并由Flink自动删除（取决于应用具体配置）。

source: Checkpoints are enabled on the StreamExecutionEnvironment:
zh_cn: 检查点可以通过StreamExecutionEnvironment来启用：

source: Checkpoints are implemented based on barriers that flow with the data and therefore avoid global synchronization across all operators of an application.
zh_cn: 它内部的检查点是基于和数据一起流动的分隔符来实现的，因此可以避免在应用所有算子间的全局同步。

source: Checkpoints are periodically taken and automatically discarded according to a configurable policy.
zh_cn: 检查点会周期性地生成，而且会根据配置的策略自动丢弃。

source: Checkpoints, Savepoints, and State Recovery
zh_cn: 检查点、保存点及状态恢复

source: Checkpoints, Savepoints, and State Recovery | 59
zh_cn: 检查点、保存点及状态恢复 | 59

source: Choosing a State Backend
zh_cn: 选择状态后端

source: Choosing a State Primitive
zh_cn: 选择状态原语

source: Classloading issues are not uncommon when running jobs with external dependen‐ cies.
zh_cn: 当你运行具有外部依赖关系的作业时，可能会经常遇到类加载方面的问题。

source: CoMapFunction and CoFlatMapFunction as argument respectively.2
zh_cn: 它们分别接收一个CoMapFunction和一个CoFlatMapFunction作为参数。2

source: Collected metrics of an application at various levels of detail
zh_cn: 以不同详细程度收集的应用程序指标

source: Colophon
zh_cn: 后记

source: Combining events of two streams is a very common requirement in stream process‐ ing.
zh_cn: 在流处理中，合并两条数据流中的事件是一个非常普遍的需求。

source: Command-Line Client on Windows
zh_cn: Windows系统中的命令行客户端

source: Committing a transaction must be an idempotent operation—the sink or exter‐ nal system should be able to notice that a transaction was already committed or a repeated commit must have no effect.
zh_cn: 提交事务的操作必须是幂等的，即数据汇或外部系统需要知道某个事务是否已经提交，或者让重复提交变得无效。

source: Common CEP use cases include financial applications, fraud detection, monitoring and alerting in complex systems, and detecting network intru‐ sion or suspicious user behavior.
zh_cn: 常见的CEP用例包括金融应用，欺诈检测，复杂系统中的监控和报警，以及检测网络入侵或可以用户行为。

source: Common antipatterns that must be avoided include:
zh_cn: 日常中应该避免一些反面模式包括：

source: Common challenges that distributed systems need to address are allocation and man‐ agement of compute resources in a cluster, process coordination, durable and avail‐ able data storage, and failure recovery.
zh_cn: 分布式系统需要应对的常见挑战包括分配和管理集群计算资源、进程协调、持久化及可用数据存储、故障恢复等。

source: Common challenges that distributed systems need to address are allocation and man‐ agement of compute resources in a cluster, process coordination, durable and highly available data storage, and failure recovery.
zh_cn: 分布式系统需要应对的常见挑战包括分配和管理集群计算资源，进程协调，持久且高可用的数据存储及故障恢复等。

source: Common choices are IntelliJ IDEA, Eclipse, or Netbeans with the appropriate plugins (such as for Maven, Git, and Scala support).
zh_cn: 常见选项有IntelliJ IDEA、Eclipse或Netbeans，它们都需要相应安装一些插件（例如Maven插件、Git插件及Scala插件）。

source: Companies employ many different applications to run their business, such as enter‐ prise resource planning (ERP) systems, customer relationship management (CRM) software, or web-based applications.
zh_cn: 一般公司都会使用很多不同种类的应用来运营业务，例如企业资源规划（ERP）系统、客户关系管理（CRM）软件、基于web的应用等。

source: Companies use all kinds of applications for their day-to-day business activities, such as enterprise resource planning (ERP) systems, customer relationship management (CRM) software, and web-based applications.
zh_cn: 公司在日常业务运营过程中会用到各类应用，例如企业资源规划（ERP）系统、客户关系管理（CRM）软件、基于web的应用等。

source: Compared to field positions and field expressions, an advantage of KeySelector functions is that the resulting key is strongly typed due to the generic types of the KeySelector class.
zh_cn: 和使用字段位置以及字段表达式相比，KeySelector函数的一大好处是它返回的键值是强类型的，因为KeySelector类需要提供泛型参数。

source: Complex data structures can also be stored as value state.
zh_cn: 该值也可以是某个复杂数据结构。

source: Components of a Flink Setup
zh_cn: 搭建Flink所需组件

source: Composite keys consisting of more than one tuple field can also be defined.
zh_cn: 你还可以利用多个元组字段定义复合键值，

source: Computation results can be updated based on late events and updates have to be emitted.
zh_cn: 根据迟到事件更新并发出计算结果。

source: Compute the average temperature every 5 seconds for a stream of sensors
zh_cn: 针对传感器数据流每5秒计算一次平均温度

source: Computing the minimum and maximum temperature per sensor and window using a ProcessWindowFunction
zh_cn: 使用ProcessWindowFunction计算每个传感器在每个窗口内的最低温和最高温。

source: Concep‐ tually, the list entries of all parallel operator tasks are collected and evenly redistrib‐ uted to a smaller or larger number of tasks.
zh_cn: 理论上，所有并行算子任务的列表条目会被统一收集起来，随后均匀分配到更少或更多的任务之上。

source: Configuration key
zh_cn: 配置键

source: Configuration of a HA Flink cluster
zh_cn: 配置Flink HA集群

source: Configuration parameter is only used by the DataSet API and not by the Data‐ Stream API.
zh_cn: 注意，Configuration参数只在DataSet API中使用而并没有在DataStream API中用到，

source: Configurations with a single slot per TaskManager have better resource isolation and can prevent a misbehaving application from interfering with unrelated applications.
zh_cn: 如果将每个TaskManager配置成只有单个处理槽可以更好地隔离资源，防止行为不当的应用对其他无关应用的干扰。

source: Configuring Checkpointing
zh_cn: 配置检查点

source: Configuring Recovery
zh_cn: 配置故障恢复

source: Configuring RocksDBStateBackend for an application
zh_cn: 为应用配置RocksDBStateBackend

source: Configuring State Backends
zh_cn: 配置状态后端

source: Configuring Time Characteristics
zh_cn: 配置时间特性

source: Configuring Time Characteristics | 111
zh_cn: 配置时间特征 | 111

source: Configuring keyed state to be queryable
zh_cn: 将键值分区状态设置为可查询的

source: Configuring the Logging Behavior
zh_cn: 配置日志行为

source: Configuring the Logging Behavior | 279
zh_cn: 配置日志行为 | 279

source: Configuring the memory of a worker process is a bit more involved because there are multiple components that allocate different types of memory.
zh_cn: 配置工作进程的内存要复杂一些，因为会有多个组件分别占用不同类型的内存。

source: Configuring the restart strategy of an application
zh_cn: 配置应用重启策略

source: Configuring these options is important to ensure reliable and smooth operation of
zh_cn: 配置好这些选项，对于保证生产环境中流式应用的可靠、稳定运维非常重要。

source: Connect, coMap, and coFlatMap
zh_cn: Connect，coMap，coFlatMap

source: Connecting a broadcast stream and keyed event stream
zh_cn: 联结广播流和键值分区事件流

source: Connecting a stateful streaming application running on Flink and an event log is interesting for multiple reasons.
zh_cn: 出于很多原因，将运行在Flink之上的状态化流处理应用和事件日志系统相连会很有意义。

source: Connectors to the most commonly used storage systems such as Apache Kafka, Apache Cassandra, Elasticsearch, JDBC, Kinesis, and (distributed) filesystems such as HDFS and S3.
zh_cn: 用于最常见存储系统的连接器，如Apache Kafka、Apache Cassandra、Elasticsearch、JDBC、Kinesis以及（分布式）文件系统（HDFS和S3等）。

source: Consequently, a running application needs to be replaced by an updated version usually without losing the state of the application.
zh_cn: 这往往要求我们在不丢失状态的前提下对当前运行的应用进行版本更新。

source: Consequently, all records with the same key access the same state.
zh_cn: 因此所有键值相同的记录都能访问到一样的状态。

source: Consequently, an application needs enough spare resources for the catch-up phase after the application was restarted to successfully resume its regular processing.
zh_cn: 因此，应用在从重启到成功恢复常规处理的进度追赶期间需要足够多的备用资源。

source: Consequently, each instance of the source function multiplexes the records of three stream partitions to emit them.
zh_cn: 因此，数据源函数实例需要将3个数据流分区中的记录混合发出。

source: Consequently, most Flink applications do not only depend on Flink’s Data‐ Stream API dependency and the Java SDK but also on additional third-party and Flink-internal dependencies.
zh_cn: 因此大多数Flink应用不仅需要依赖Flink的DataStream API和Java SDK，还需要额外的第三方库和Flink内部依赖。

source: Consequently, records of both inputs are processed based on the same event-time clock.
zh_cn: 这就导致所有输入的记录都必须基于同一个事件时间时钟来处理。
